load-tests/ceiling-with-ai-mock.yml
config:
  # Hits the LIVE Render deployment directly over Socket.IO, bypassing the
  # browser and Vercel entirely — this finds the backend's own ceiling, not
  # "how many Chromium tabs fit on my laptop".
  #
  # The AI is MOCKED here (hence the name): with LOAD_TEST=true the backend
  # streams a fixed canned reply instead of calling OpenAI, so this measures
  # the server's own connection and transport capacity with the model's
  # latency and cost taken out of the picture. Pair it with
  # ceiling-ai-without-mock.yml, which runs the same ramp with the real model
  # in the loop; the gap between the two reports is the model's contribution.
  #
  # REQUIRES LOAD_TEST=true set on Render for the duration of this run.
  # Without it, every VU triggers a real gpt-4o-mini call, and the exact-match
  # `response.data` below will never match real generated text — Artillery's
  # emit/response sugar needs a literal match (see scripts/realistic-processor.js
  # for the full explanation), so every request would silently eat the full
  # response timeout instead of reporting its real latency, AND you'd pay
  # OpenAI for it. A run that comes back ~100% failures is almost always this
  # flag being unset. Flip it back to unset/false on Render when done.
  #
  # Render's free tier is a single instance on 0.1 CPU / 512MB with no
  # autoscaling, so phases below stage gradually — the goal is to pinpoint
  # where it bends, not just confirm it eventually does. Capped at 200/sec by
  # agreement (see report for the reasoning).
  #
  # Note: phases here are 15-20s, which do NOT line up with Artillery's fixed
  # 10s reporting window, so the report's phase table will carry the "*"
  # misalignment caveat on some rows. ceiling-ai-without-mock.yml uses 10s
  # phases and avoids that.
  target: "https://conversebot-backend.onrender.com"
  socketio:
    transports: ["websocket"]
  phases:
    # Render free instances spin down after ~15min idle; this also absorbs
    # the 30-60s cold-start spin-up so it doesn't skew the real phases.
    - name: warm up / cold start
      duration: 20
      arrivalRate: 2
    - name: ramp to 15
      duration: 20
      arrivalRate: 2
      rampTo: 15
    - name: sustain at 15
      duration: 20
      arrivalRate: 15
    - name: ramp to 35
      duration: 20
      arrivalRate: 15
      rampTo: 35
    - name: sustain at 35
      duration: 20
      arrivalRate: 35
    - name: ramp to 60
      duration: 20
      arrivalRate: 35
      rampTo: 60
    - name: sustain at 60
      duration: 20
      arrivalRate: 60
    - name: ramp to 100
      duration: 20
      arrivalRate: 60
      rampTo: 100
    - name: sustain at 100
      duration: 20
      arrivalRate: 100
    - name: ramp to 150
      duration: 20
      arrivalRate: 100
      rampTo: 150
    - name: sustain at 150
      duration: 15
      arrivalRate: 150
    - name: ramp to 200
      duration: 20
      arrivalRate: 150
      rampTo: 200
    - name: sustain at 200
      duration: 15
      arrivalRate: 200

scenarios:
  - name: single chat message
    engine: socketio
    flow:
      - emit:
          channel: "user_message"
          data:
            messages:
              - role: "user"
                content: "Say hello in one short sentence."
        response:
          on: "bot_done"
          data:
            fullText: "Hello! This is a mocked reply for load testing."