load-tests/deployed-ceiling-ai-10s.yml
config:
  # Same real-AI ceiling test as deployed-ceiling-ai.yml (same rate
  # progression: 2 -> 15 -> 35 -> 60 -> 100 -> 150 -> 200/sec), but every
  # phase is exactly 10 seconds — matching Artillery's own fixed 10s
  # metrics-reporting window exactly. That means every phase boundary lands
  # on a window boundary: each row in the report's "Traffic ramp: expected
  # vs. actual, by phase" table maps to exactly one window, with nothing
  # blending into its neighbor (no "*" misalignment caveat, ever).
  #
  # Trade-off: this compresses the same rate levels into less time per step
  # (10s instead of 15-20s), so it's a faster, sharper ramp than
  # deployed-ceiling-ai.yml — less time to settle at each rate before the
  # next one starts. Use this one when you want clean, directly-comparable
  # phase-vs-window numbers; use deployed-ceiling-ai.yml when you want a
  # gentler ramp that gives each level more time to reveal steady-state
  # behavior.
  #
  # No LOAD_TEST flag needed — real gpt-4o-mini replies, same as
  # deployed-ceiling-ai.yml. Every VU here is a real, billed OpenAI call.
  target: "https://conversebot-backend.onrender.com"
  socketio:
    transports: ["websocket"]
  processor: "./scripts/realistic-processor.js"
  phases:
    - name: warm up / cold start
      duration: 10
      arrivalRate: 2
    - name: ramp to 15
      duration: 10
      arrivalRate: 2
      rampTo: 15
    - name: sustain at 15
      duration: 10
      arrivalRate: 15
    - name: ramp to 35
      duration: 10
      arrivalRate: 15
      rampTo: 35
    - name: sustain at 35
      duration: 10
      arrivalRate: 35
    - name: ramp to 60
      duration: 10
      arrivalRate: 35
      rampTo: 60
    - name: sustain at 60
      duration: 10
      arrivalRate: 60
    - name: ramp to 100
      duration: 10
      arrivalRate: 60
      rampTo: 100
    - name: sustain at 100
      duration: 10
      arrivalRate: 100
    - name: ramp to 150
      duration: 10
      arrivalRate: 100
      rampTo: 150
    - name: sustain at 150
      duration: 10
      arrivalRate: 150
    - name: ramp to 200
      duration: 10
      arrivalRate: 150
      rampTo: 200
    - name: sustain at 200
      duration: 10
      arrivalRate: 200

scenarios:
  - name: real chat message
    engine: socketio
    flow:
      - function: "sendAndTime"