load-tests/deployed-ceiling-ai.yml
config:
  # Same idea as deployed-ceiling.yml (ramp until it bends, find the break),
  # but against REAL gpt-4o-mini replies instead of mock mode — so this
  # answers "where's the ceiling under real AI traffic", not "where's the
  # raw connection ceiling". No LOAD_TEST flag needed; leave it unset/false
  # on Render for this one.
  #
  # Can't use the emit+response exact-match sugar deployed-ceiling.yml uses
  # (real replies are unpredictable text, so an exact match never fires —
  # see deployed-realistic.yml's comment). Reuses that same custom step,
  # scripts/realistic-processor.js, which drives the raw socket and times
  # emit -> bot_done/bot_error directly, with a 25s per-reply timeout.
  #
  # Every VU here is a real, billed OpenAI call. This uses the SAME phases
  # as deployed-ceiling.yml (ramping to 200/sec) at the user's request — but
  # note we already learned the hard way (running deployed-ceiling.yml
  # itself against real replies instead of mock mode) that pushing real AI
  # traffic that high just drowns in OpenAI's own rate-limiting/connection
  # errors well before it reveals anything about THIS app's capacity: that
  # run came back 100% failed with no usable signal. Expect the same here
  # unless OpenAI's per-account limits on this key are unusually high.
  # ~18,700 total calls across the run if it completes.
  target: "https://conversebot-backend.onrender.com"
  socketio:
    transports: ["websocket"]
  processor: "./scripts/realistic-processor.js"
  phases:
    # Absorbs the free tier's 30-60s cold-start spin-up if the instance was idle.
    - name: warm up / cold start
      duration: 20
      arrivalRate: 2
    - name: ramp to 15
      duration: 20
      arrivalRate: 2
      rampTo: 15
    - name: sustain at 15
      duration: 20
      arrivalRate: 15
    - name: ramp to 35
      duration: 20
      arrivalRate: 15
      rampTo: 35
    - name: sustain at 35
      duration: 20
      arrivalRate: 35
    - name: ramp to 60
      duration: 20
      arrivalRate: 35
      rampTo: 60
    - name: sustain at 60
      duration: 20
      arrivalRate: 60
    - name: ramp to 100
      duration: 20
      arrivalRate: 60
      rampTo: 100
    - name: sustain at 100
      duration: 20
      arrivalRate: 100
    - name: ramp to 150
      duration: 20
      arrivalRate: 100
      rampTo: 150
    - name: sustain at 150
      duration: 15
      arrivalRate: 150
    - name: ramp to 200
      duration: 20
      arrivalRate: 150
      rampTo: 200
    - name: sustain at 200
      duration: 15
      arrivalRate: 200

scenarios:
  - name: real chat message
    engine: socketio
    flow:
      - function: "sendAndTime"